{
    "config_error": "%s has not been properly configured, check the Nagmap Reborn configuration file and make the necessary corrections! Defined value: (%s)",
    "moduleError": "The module/extension (%s) was not found, it is essential for the operation of the Nagmap Reborn, please install the module/extension before proceeding.",
    "file_not_find_error": "%s does not exist! Please set the variable in Nagmap Reborn config file!",
    "in_definition_error": "Starting a new in_definition before closing the previous one! That is not cool.",
    "emptyUserPass": "Authentication username and/or password have not been defined, set user and password in the configuration file.",
    "updateError": "There was a problem updating the status of hosts, displayed statuses may be outdated, check the console for more information.",
    "updateErrorDenied": "There was a problem updating the status of the hosts, access was denied, please authenticate again!",
    "updateMissing": "There was a problem updating the status of the hosts, one or more hosts could not be found! Check the console for more information.",
    "updateErrorServ": "This type of error is usually related to the following problem: The server is inaccessible or recusing connections, check the server and your connection.",
    "updateErrorStatus": "This type of error is usually related to the following problem: The status file is inaccessible or does not exist, verify that the monitoring service is executing correctly.",
    "updateErrorChanges": "This type of error is usually related to the following problem: Host modifications, addition, removal or editing of names have occurred, in this case update the page.",
    "updateErrorSolved": "Issue solved, the statuses displayed are in real time.",
    "accessDenied": "Access denied, incorrect username and/or password! Reload the page and try again.",
    "alias": "Alias",
    "hostG": "Hostgroups",
    "newVersion": "Update available",
    "newVersionFooter": "It will close after 10 seconds.",
    "newVersionText": "<br>The currently used version of Nagmap Reborn is outdated!<br><br>Get the new version on GitHub:<br><br>",
    "passAlertTitle": "Default authentication",
    "passAlert": "Currently you are using the password and default user, do not be unprotected, modify it now!",
    "up": "UP",
    "down": "DOWN",
    "warning": "WARNING",
    "unknown": "UNKNOWN",
    "critical": "CRITICAL",
    "and": "and",
    "waiting": "Waiting",
    "timePrefix": "",
    "timeSuffix": " ago.",
    "filter": "Filter",
    "clear": "Clear",
    "project": "Project on GitHub",
    "btop": "Back to top",
    "starting": "Starting, wait.",
    "stopped": "Stopped",
    "downData": "Download data",
    "verifications": "Checks (static)",
    "ignHosts": "Ignored hosts (static)",
    "statusFile": "Status file info (dynamic)",
    "hostName": "Host name",
    "reasons": "Reason(s)",
    "tServ": "The service ",
    "tHost": "The host ",
    "cs": "Current state",
    "lhs": "Last hard state",
    "lsc": "Last state change",
    "lhsc": "Last hard state change",
    "ltup": "Last time up",
    "ltd": "Last time down",
    "ltun": "Last time unreachable",
    "lto": "Last time ok",
    "ltw": "Last time warning",
    "ltunk": "Last time unknown",
    "ltc": "Last time critical",
    "isUp": "is up",
    "isDown": "is down",
    "inWar": "is in warning",
    "incrit": "is critical",
    "isunk": "has an unknown status",
    "controlInfo": "Stop/Start information update",
    "appStatus": "Current application status",
    "noLatLng": "It has no definition of LatLng in the settings",
    "noHostN": "Do not have a HostName",
    "noStatus": "It does not exist in the Status file",
    "outFilterHg": "It is not in the filtered HostGroup.",
    "help": "Help",
    "close": "Close",
    "primary": " (Primary)",
    "debugHelp": "This page contains helpful information when requesting support! The characteristics of the pages are these: <strong>1 - Checks.</strong>      - Displays information about access control.      - Displays information about automatic error reporting.      - Displays information about file integrity.      - Reports important data and warnings about reported data. <strong>2 - Hosts that were ignored.</strong>      - Displays all the ignored hosts.      - Informs the host name.      - The host alias.      - The reasons or motives of that host have been ignored.      - The reasons can be very useful to define if it was a configuration error or application bug. <strong>3 - Important information about each host in the Status file.</strong>      - The color of the Card indicates the status of the host or service in question.      - Shows information about internal status.          - Green: ok; Yellow: warning; Orange: critical; Gray: unknown.      - Displays the time values for several parameters.      - Displays the time in Epoch format and the time in hours and minutes. <strong>4 - In the footer of the page there is the controller to update the page information.</strong>      - It is possible to stop the update at any time, useful for capturing quick events.      - There is also a download button that downloads a file with the information on the page right now.      - The download button is disabled during page information updates. <strong>Whenever requesting support</strong> access the debug page download the file and attach in your request, this procedure can and will make troubleshooting easier. You can get support by contacting me via e-mail: <strong>joao_carlos.r@hotmail.com</strong>",
    "authFail": "Authentication failed! Try again.",
    "noAuthDanger": "<strong>Danger: </strong> Access control is currently disabled!",
    "defaultPassUser": "<strong>Attention: </strong> Currently you are using the password and default user, do not be unprotected, modify it now!",
    "AuthOk": "<strong>All right: </strong> Access control is enabled and default user change and password has been performed.",
    "reportOffOF": "<strong>Danger: </strong> One or more main project files have been modified, so it is not possible to automatically report bugs.",
    "reportOff": "<strong>Attention: </strong> Automatic errors reporting is disabled!",
    "reportOk": "<strong>All right: </strong> All errors are reported automatically!",
    "reportDataRequestP1": "*To request all data collected from error reports, please send an email to: joao_carlos.r@hotmail.com<br>In the subject: Data of the report of errors.<br>In the body of the email, enter the domain (url) through which the service is accessed and your",
    "reportDataRequestP2": "report token",
    "reportDataRequestP3": "<br>Your request will be dealt with as soon as possible, if necessary for security reasons, other forms of domain verification will be requested.",
    "yourRToken": "Your report token",
    "accessControl": "Access control",
    "errorReporting": "Error reporting",
    "fileIntegrity": "Files integrity",
    "reportCountP1": "<strong>Data: </strong>You have made",
    "reportCountP2": "valid report(s) in the last 7 days.",
    "debugFile": "File",
    "debugIntegrity": "Integrity",
    "address": "Address",
    "parent": "Parents",
    "start": "Let's get started!",
    "wait": "Please wait while the {{t}}",
    "debug_pg": "Debug page",
    "debug_csl": "Debug console",
    "cover_error": "An error has occurred!",
    "cr_map": "map is created",
    "cr_extras": "extra elements are created",
    "cr_hosts": "hosts are loaded",
    "cr_markers": "markers are generated",
    "cr_lines": "lines are drawn",
    "load": "dependencies are loaded",
    "too_long": "This is taking too long, please refresh the page!",
    "too_long_details": "This error occurs when the initialization takes more than 50 seconds to complete, in this situation it is recommended to enable the debug to obtain the complete step-by-step report of the startup.",
    "as_filter": "Use as filter",
    "not_released": "This is a rc (release candidate) version, it already has all the functionality of the final version, but it may contain minor bugs.<br><br>Its use is recommended only for testing and early users.<br><br>For use in production the <strong>stable version</strong> should be adopted.",
    "last_stable": "Get the latest stable version.",
    "details": "Details",
    "unsupported_browser": "<i class='material-icons' style='font-size: 5vh;'>warning</i> this browser is not compatible with NagmapReborn, please upgrade your browser or use a more modern one!",
    "ngr_init_error": "Failed to initialize class!"
}